benchmarks/fileio_benchmark.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      2715.97
    writes/s:                     1810.15
    fsyncs/s:                     5991.12

Throughput:
    read, MiB/s:                  42.44
    written, MiB/s:               28.28

General statistics:
    total time:                          10.0252s
    total number of events:              103447

Latency (ms):
         min:                                    0.00
         avg:                                    1.54
         max:                                   73.56
         95th percentile:                        5.00
         sum:                               159686.47

Threads fairness:
    events (avg/stddev):           6465.4375/71.18
    execution time (avg/stddev):   9.9804/0.00